data/google/gke/cpu/128/node-127/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     10017.13
    fsyncs/s:                     12828.70

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               156.52

General statistics:
    total time:                          10.0069s
    total number of events:              228503

Latency (ms):
         min:                                    0.02
         avg:                                    0.04
         max:                                   27.53
         95th percentile:                        0.04
         sum:                                 9955.09

Threads fairness:
    events (avg/stddev):           228503.0000/0.00
    execution time (avg/stddev):   9.9551/0.00